package game;

public class Registration {
    /**
     * |=======================
     * |Добро пожаловать в мир игры ....
     * |1. Регистрация
     * |2. Авторизация
     * |=======================
     */

    // 1
    /**
     * |=======================
     * |Выберите класс персонажа:
     * |
     * |
     * |
     * |
     * |=======================
     */

    /**
     * |=======================
     * |Введите ник персонажа:
     * |
     * |
     * |
     * |
     * |=======================
     */

    // Какие характеристики у каждого персонажа?
    // Какая формула урона?
    // Как характеристики повышаются с уровнем персонажа у каждого класса?

    // 2

    /**
     * |=======================
     * |Укажите путь до вашего сохранения:
     * |=======================
     */
}
